mistyk/inavradar-ESP32/src/main.cpp
#include <Arduino.h>
#include <esp_system.h>
#include <lib/MSP.h>
#include <lib/LoRa.h>
#include <SSD1306.h>
#include <EEPROM.h>
#include <main.h>


// ----------------------------------------------------------------------------- global vars

SSD1306 display(0x3c, 4, 15);

config_t cfg;
MSP msp;

curr_t curr; // Our peer
peer_t peers[LORA_NODES]; // Other peers
air_type0_t air_0;
air_type1_t air_1;
air_type1_t * air_r;

stats_t stats;
int sys_rssi;
uint8_t main_mode;
uint8_t last_received_id = 0;
char sys_message[20];

// --- Counters

uint8_t sys_pps = 0;
uint8_t sys_ppsc = 0;
int sys_num_peers = 0;
uint8_t sys_lora_sent;

// --- Inputs outputs

uint8_t sys_display_page = 0;
uint32_t io_button_released = 0;
bool io_button_pressed = 0;
bool display_enabled = 1;


// Timing

uint32_t cycle_scan_begin;
uint32_t last_tx_begin;
uint32_t last_tx_end;
uint32_t lora_last_tx = 0;
uint32_t lora_next_tx = 0;
uint32_t lora_last_rx = 0;
int32_t lora_drift = 0;
uint32_t stats_updated = 0;
uint32_t msp_next_cycle = 0;
int msp_step = 0;
uint32_t display_updated = 0;
uint32_t now = 0;
int drift_correction = 0;

// -------- SYSTEM

void set_mode(uint8_t mode) {

    switch (mode) {

    case 0 :
        cfg.lora_frequency = 433E6; // 433E6, 868E6, 915E6
        cfg.lora_bandwidth = 250000;
        cfg.lora_coding_rate = 5;
        cfg.lora_spreading_factor = 9;
        cfg.lora_power = 20;
        cfg.lora_cycle = 500;
        cfg.lora_slot_spacing = 125;
        cfg.lora_timing_delay = -60;
        cfg.lora_antidrift_threshold = 5;
        cfg.lora_antidrift_correction = 5;
        cfg.lora_peer_timeout = 5000;

        cfg.msp_fc_timeout = 7000;
        cfg.msp_after_tx_delay = 85;
        
        cfg.cycle_scan = 3000;
        cfg.cycle_display = 125;
        cfg.cycle_stats = 1000;

        break;
    }
}

int count_peers() {
    int j = 0;
    for (int i = 0; i < LORA_NODES; i++) {
        if (peers[i].id > 0) {
            j++;
        }
    }
    return j;
}

void reset_peers() {
    now = millis();
    for (int i = 0; i < LORA_NODES; i++) {
        peers[i].id = 0;
        peers[i].host = 0;
        peers[i].state = 0;
        peers[i].broadcast = 0;
        peers[i].lq_updated = now;
        peers[i].lq_tick = 0;
        peers[i].lq = 0;
        peers[i].updated = 0;
        peers[i].rssi = 0;
        strcpy(peers[i].name, "----");
    }
}

void pick_id() {
    curr.id = 0;
    for (int i = 0; i < LORA_NODES; i++) {
        if ((peers[i].id == 0) && (curr.id == 0)) {
            curr.id = i + 1;
        }
    }
}

void resync_tx_slot(int16_t delay) {
    bool startnow = 0;
    for (int i = 0; (i < LORA_NODES) && (startnow == 0); i++) { // Resync
        if (peers[i].id > 0) {
            lora_next_tx = peers[i].updated + (curr.id - peers[i].id) * cfg.lora_slot_spacing + cfg.lora_cycle + delay;
            startnow = 1;
        }
    }
}

// -------- LoRa

void lora_send() {

    sys_lora_sent++;

    if (sys_lora_sent % 10 == 0) {
        air_1.id = curr.id;
        air_1.type = 1;
        air_1.host = curr.host;
        air_1.state = 0;
        air_1.broadcast = 0;
        air_1.speed = curr.gps.groundSpeed / 100;
        strncpy(air_1.name, curr.name, LORA_NAME_LENGTH);

        while (!LoRa.beginPacket()) {  }
        LoRa.write((uint8_t*)&air_1, sizeof(air_1));
        LoRa.endPacket(false);
    }
    else {
        air_0.id = curr.id;
        air_0.type = 0;
        air_0.lat = curr.gps.lat / 100;
        air_0.lon = curr.gps.lon / 100;
        air_0.alt = curr.gps.alt / 100;
        air_0.heading = curr.gps.groundCourse / 10;

        while (!LoRa.beginPacket()) {  }
        LoRa.write((uint8_t*)&air_0, sizeof(air_0));
        LoRa.endPacket(false);
    }
}

void lora_receive(int packetSize) {

    if (packetSize == 0) return;

    lora_last_rx = millis();
    lora_last_rx -= (stats.last_tx_duration > 0 ) ? stats.last_tx_duration : 0; // RX time should be the same as TX time

    sys_rssi = LoRa.packetRssi();
    sys_ppsc++;

    LoRa.readBytes((uint8_t *)&air_0, packetSize);

    uint8_t id = air_0.id - 1;
    last_received_id = air_0.id;
    peers[id].id = last_received_id;
    peers[id].lq_tick++;
    peers[id].updated = lora_last_rx;
    peers[id].rssi = sys_rssi;

    if (air_0.type == 1) { // Type 1 packet (Speed + host + state + broadcast + name)

        air_r = (air_type1_t*)&air_0;

        peers[id].host = (*air_r).host;
        peers[id].state = (*air_r).state;
        peers[id].broadcast = (*air_r).broadcast;
        peers[id].gps.groundSpeed = (*air_r).speed * 100;
        strncpy(peers[id].name, (*air_r).name, LORA_NAME_LENGTH);
        peers[id].name[LORA_NAME_LENGTH] = 0;

    }
    else { // Type 0 packet (GPS + heading)

        peers[id].gps.lat = air_0.lat * 100;
        peers[id].gps.lon = air_0.lon * 100;
        peers[id].gps.alt = air_0.alt * 100;
        peers[id].gps.groundCourse = air_0.heading * 10;
    }



    sys_num_peers = count_peers();

    if ((last_received_id == curr.id) && (main_mode > MODE_LORA_SYNC)) { // Same slot, conflict
        uint32_t cs1 = peers[id].name[0] + peers[id].name[1] * 26 + peers[id].name[2] * 26 * 26 ;
        uint32_t cs2 = curr.name[0] + curr.name[1] * 26 + curr.name[2] * 26 * 26;
        if (cs1 < cs2) { // Pick another slot
            sprintf(sys_message, "%s", "ID CONFLICT");
            pick_id();
            resync_tx_slot(cfg.lora_timing_delay);
        }
    }
}

void lora_init() {

    SPI.begin(5, 19, 27, 18);
    LoRa.setPins(SS, RST, DI0);

    if (!LoRa.begin(cfg.lora_frequency)) {
        display.drawString (94, 9, "FAIL");
        while (1);
    }

    LoRa.sleep();
    LoRa.setSignalBandwidth(cfg.lora_bandwidth);
    LoRa.setCodingRate4(cfg.lora_coding_rate);
    LoRa.setSpreadingFactor(cfg.lora_spreading_factor);
    LoRa.setTxPower(cfg.lora_power, 1);
    LoRa.setOCP(250);
    LoRa.idle();
    LoRa.onReceive(lora_receive);
    LoRa.enableCrc();
}

// ----------------------------------------------------------------------------- Display

void display_init() {
    pinMode(16, OUTPUT);
    pinMode(2, OUTPUT);
    digitalWrite(16, LOW);
    delay(50);
    digitalWrite(16, HIGH);
    display.init();
    display.flipScreenVertically();
    display.setFont(ArialMT_Plain_10);
    display.setTextAlignment(TEXT_ALIGN_LEFT);
}

void display_disable() {
    display.displayOff();
    display_enabled = 0;
}

void display_enable() {
    display.displayOn();
    display_enabled = 1;
}

