mistyk/inavradar-ESP32/src/main.cpp
void display_draw() {
    display.clear();

    int j = 0;
    int line;

    if (sys_display_page == 0) {

        display.setFont(ArialMT_Plain_24);
        display.setTextAlignment(TEXT_ALIGN_RIGHT);
        display.drawString(26, 11, String(curr.gps.numSat));
        display.drawString(13, 42, String(sys_num_peers));
        // display.drawString(119, 0, String((float)curr.vbat / 10));

        display.setFont(ArialMT_Plain_10);
        display.drawString (126, 29, "_ _ _ _ _ _ _ _ _ _ _ _ _ _ _ ");
        display.drawString(60, 44, String(sys_pps));
        display.drawString (107, 44, String(stats.percent_received));
        display.drawString(107, 54, String(sys_rssi));

        display.setTextAlignment (TEXT_ALIGN_CENTER);
        display.drawString (64, 0, String(sys_message));
        
        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.drawString (60, 23, String(curr.name));
        display.drawString (27, 23, "SAT");
        display.drawString (108, 44, "%E");
        display.drawString (15, 44, "ID");
        display.drawString (28, 44, String(curr.id));
        display.drawString (62, 44, "PS");
        display.drawString (109, 54, "dB");
        display.drawString (60, 12, String(host_name[curr.host]));
//        display.drawString (120,12, "V");

        if (last_received_id > 0) {
            display.drawString (36 + last_received_id * 8, 54, String(last_received_id));
        }

        if (sys_num_peers == 0) {
            display.drawString (15, 54, "Solo");
            }
        else if (sys_num_peers == 1) {
            display.drawString (15, 54, "Peer");
            }
        else {
            display.drawString (15, 54, "Peers");
            }

        if (curr.gps.fixType == 1) display.drawString (27, 12, "2D");
        if (curr.gps.fixType == 2) display.drawString (27, 12, "3D");
    }

    else if (sys_display_page == 1) {

        display.setFont (ArialMT_Plain_10);
        display.setTextAlignment (TEXT_ALIGN_LEFT);

        display.drawString(0, 0, "HOST:");
        display.drawString(0, 10, "GPS LAT");
        display.drawString(0, 20, "GPS LON");
        display.drawString(0, 30, "GPS ALT");
        display.drawString(0, 40, "HEADING");
        display.drawString(0, 50, "STATE");
        
        display.drawString (32, 0, String(curr.name));

        display.setTextAlignment(TEXT_ALIGN_RIGHT);
        display.drawString (128, 0, String(host_name[curr.host]));
        display.drawString (128, 10, String((float)curr.gps.lat/10000000, 6));
        display.drawString (128, 20, String((float)curr.gps.lon/10000000, 6));
        display.drawString (128, 30, String((float)curr.gps.alt));
        display.drawString (128, 40, String((float)curr.gps.groundCourse / 10));
        display.drawString (128, 50, String(host_state[curr.state]));
        
    }

    else if (sys_display_page == 2) {

        display.setFont (ArialMT_Plain_10);
        display.setTextAlignment (TEXT_ALIGN_LEFT);

        int j = 0;
        for (int i = 0; i < LORA_NODES ; i++) {
            if (peers[i].id > 0 && j < 3) {
                line = j * 20;
                display.setTextAlignment (TEXT_ALIGN_LEFT);
                display.drawString (0, line, String(peers[i].id) + ":");
                display.drawString (13, line, String(peers[i].name));
//              display.drawString (50, line, String(host_name[peers[i].host]));
                display.drawString (50, line, "LQ" + String(peers[i].lq));
                display.drawString (13, line + 10, String(peers[i].rssi) + "db");
                display.drawString (50, line + 10, String(peers[i].gps.groundCourse) + "°");
//              display.drawString (13, line + 20, "S:" + String(peers[i].gps.groundSpeed));

                display.setTextAlignment (TEXT_ALIGN_RIGHT);
                display.drawString (128, line, String((float)peers[i].gps.lat/10000000,5));
                display.drawString (128, line + 10, String((float)peers[i].gps.lon/10000000,5));

                j++;
            }
        }
        if (j == 0) {
            display.drawString (0, 0, "NO PEER DETECTED");
        }
    }
    else if (sys_display_page == 3) {

        display.setFont (ArialMT_Plain_10);
        display.setTextAlignment (TEXT_ALIGN_LEFT);
        display.drawString (0, 1 , "_____________________");
        display.drawString (3, 4 , ".");
        display.drawString (60, 4 , ".");
        display.drawString (122, 4 , ".");
        display.drawString (0, 14 , String(cfg.lora_cycle));
        display.drawString (52, 14 , String(cfg.lora_cycle / 2));
        display.drawString (120, 14 , "0");

        long pos[LORA_NODES];
        now = millis();
        long diff;

        for (int i = 0; i < LORA_NODES ; i++) {
            if (peers[i].id != 0) {
                diff = now - peers[i].updated;
                if ( diff < cfg.lora_cycle) {
                    pos[i] = 120 - 120 * diff / cfg.lora_cycle;
                }
            }
            else {
                pos[i] = 0;
            }
        }

        diff = now - lora_last_tx;
        if ( diff < cfg.lora_cycle) {
            display.drawString (120 - 120 * diff / cfg.lora_cycle, 0, String(curr.id));
        }

        for (int i = 0; i < LORA_NODES ; i++) {
            if (pos[i] > 0) {
                display.drawString (pos[i], 0, String(peers[i].id));
            }

            if (peers[i].id > 0 && j < 4) {
            line = j * 9 + 24;
                display.setTextAlignment (TEXT_ALIGN_LEFT);
                display.drawString (0, line, String(peers[i].id) + ":");
                display.drawString (16, line, String(peers[i].name));
                display.drawString (56, line, String(host_name[peers[i].host]));
                display.setTextAlignment (TEXT_ALIGN_RIGHT);

                if (lora_last_tx > peers[i].updated) {
                    display.drawString (120, line, String(lora_last_tx - peers[i].updated));
                    display.drawString (128, line, "-");
                }
                else {
                    display.drawString (120, line, String((peers[i].updated) - lora_last_tx));
                    display.drawString (128, line, "+");
                }
            j++;
            }
        }

