mistyk/inavradar-ESP32/src/main.cpp
        if (sys_num_peers == 0) { // Alone, start at will
            lora_next_tx = millis() + cfg.lora_cycle;
            }
        else { // Not alone, sync by slot
            resync_tx_slot(cfg.lora_timing_delay);
        }
        display_updated = millis();
        stats_updated = millis();

        sys_pps = 0;
        sys_ppsc = 0;
        sys_num_peers = 0;
        stats.packets_total = 0;
        stats.packets_received = 0;
        stats.percent_received = 0;
//        peerout.tick = 0;

        main_mode = MODE_LORA_RX;
        }

// ---------------------- LORA RX

    if ((main_mode == MODE_LORA_RX) && (millis() > lora_next_tx)) {
        now = millis();

        while (now > lora_next_tx) { // In  case we skipped some beats
           lora_next_tx += cfg.lora_cycle;
        }
        main_mode = MODE_LORA_TX;
    }

// ---------------------- LORA TX

    if (main_mode == MODE_LORA_TX) {

        if ((curr.host == HOST_NONE) || (curr.gps.fixType < 1)) {
            curr.gps.lat = 0;
            curr.gps.lon = 0;
            curr.gps.alt = 0;
            curr.gps.groundCourse = 0;
            curr.gps.groundSpeed = 0;
        }

        // peerout.tick++;

        // stats.last_tx_begin = millis();
        lora_last_tx = millis();
        lora_send();
        stats.timer_end = millis();
        stats.last_tx_duration = stats.timer_end - lora_last_tx;

        // Drift correction

        if (curr.id > 1) {
            int prev = curr.id - 2;
            if (peers[prev].id > 0) {
                lora_drift = lora_last_tx - peers[prev].updated - cfg.lora_slot_spacing;

                if ((abs(lora_drift) > cfg.lora_antidrift_threshold) && (abs(lora_drift) < (cfg.lora_slot_spacing * 0.5))) {
                    drift_correction = constrain(lora_drift, -cfg.lora_antidrift_correction, cfg.lora_antidrift_correction);
                    lora_next_tx -= drift_correction;
                    sprintf(sys_message, "%s %3d", "TIMING ADJUST", -drift_correction);
                }
            }
        }

        msp_step = 0;
        msp_next_cycle = stats.last_tx_begin + cfg.lora_slot_spacing + cfg.msp_after_tx_delay;

        // Back to RX

        LoRa.sleep();
        LoRa.receive();
        main_mode = MODE_LORA_RX;
    }

// ---------------------- DISPLAY

    if ((millis() > display_updated + cfg.cycle_display) && display_enabled && (main_mode > MODE_LORA_SYNC)) {

        stats.timer_begin = millis();
        display_draw();
        stats.timer_end = millis();
        stats.last_oled_duration = stats.timer_end - stats.timer_begin;
        display_updated = millis();
    }

// ---------------------- SERIAL / MSP


    if (((millis() > msp_next_cycle) && (msp_step < 3) && (curr.host != HOST_NONE)) && (main_mode > MODE_LORA_SYNC)) {

        switch (msp_step) {

        case 0: 
            msp_set_state();
            break;

        case 1: 
            stats.timer_begin = millis();
            msp.request(MSP_RAW_GPS, &curr.gps, sizeof(curr.gps));
            stats.timer_end = millis();
            stats.last_msp_rx_duration = stats.timer_end - stats.timer_begin;
            break;

        case 2: 
            stats.timer_begin = millis();
            msp_send_peers();
            stats.timer_end = millis();
            stats.last_msp_tx_duration = stats.timer_end - stats.timer_begin;
            break;

        }

        msp_next_cycle += cfg.lora_slot_spacing;
        msp_step++;
    }


// ---------------------- STATISTICS & IO

    if ((millis() > (cfg.cycle_stats + stats_updated)) && (main_mode > MODE_LORA_SYNC)) {

        sys_pps = sys_ppsc;
        sys_ppsc = 0;
        now = millis();

        // Pruning the timed-out peers + LQ computation

        for (int i = 0; i < LORA_NODES; i++) {
    
            if (now > (peers[i].lq_updated +  cfg.lora_cycle * 4)) {
                uint16_t diff = peers[i].updated - peers[i].lq_updated;
                peers[i].lq = constrain(peers[i].lq_tick * 4.4 * cfg.lora_cycle / diff, 0, 4);
                peers[i].lq_updated = now;
                peers[i].lq_tick = 0;
            }
        
            if (peers[i].id > 0 && ((now - peers[i].updated) > cfg.lora_peer_timeout)) {
                peers[i].state = 0;
                peers[i].id = 0;
                sys_rssi = 0;
            }

        }

        sys_num_peers = count_peers();
        stats.packets_total += sys_num_peers * cfg.cycle_stats / cfg.lora_cycle;
        stats.packets_received += sys_pps;
        stats.percent_received = (stats.packets_received > 0) ? constrain(100 * stats.packets_received / stats.packets_total, 0 ,100) : 0;

        // Screen management

        if ((curr.state == 0) && (display_enabled == 0)) { // Aircraft is disarmed = Turning on the OLED
            display_enable();
        }

        else if ((curr.state == 1) && (display_enabled == 1)) { // Aircraft is armed = Turning off the OLED
            display_disable();
        }

    stats_updated = millis();
    }

}
